{
    "Use a few words, avoid common phrases": "Použijte více slov, vyhněte se obvyklým frázím",
    "No need for symbols, digits, or uppercase letters": "Nejsou vyžadovány symboly, číslice či velká písmena",
    "Add another word or two. Uncommon words are better.": "Přidejte jedno nebo dvě další slova. Čím neobyklejší, tím lépe.",
    "Straight rows of keys are easy to guess": "Posloupnosti sousedních znaků je lehké uhádnout",
    "Short keyboard patterns are easy to guess": "Krátké posloupnosti znaků z klávesnice je lehké uhádnout",
    "Use a longer keyboard pattern with more turns": "Použijte delší posloupnost stisknutých kláves",
    "Repeats like 'aaa' are easy to guess": "Opakování jako 'aaa' je lehké uhádnout",
    "Repeats like 'abcabcabc' are only slightly harder to guess than 'abc'": "Opakování jako 'abcabcabc' jsou jen o málo složitější než 'abc'",
    "Avoid repeated words and characters": "Vyhněte se opakování slov a znaků",
    "Sequences like abc or 6543 are easy to guess": "Posloupnosti jako 'abc' či '6543' lze snadno uhádnout",
    "Avoid sequences": "Vyhněte se posloupnostem",
    "Recent years are easy to guess": "Roky lze snadno uhádnout",
    "Avoid recent years": "Vyhněte se používání roků",
    "Avoid years that are associated with you": "Nepoužívejte roky, které lze asociovat s Vámi",
    "Dates are often easy to guess": "Datumy lze obvykle snadno uhodnout",
    "Avoid dates and years that are associated with you": "Nepoužívejte datumy a roky, které lze asociovat s Vámi",
    "This is a top-10 common password": "Toto heslo je mezi 10 nejpoužívanějšími",
    "This is a top-100 common password": "Toto heslo je mezi 100 nejpoužívanějšími",
    "This is a very common password": "Toto heslo patří mezi častá hesla",
    "This is similar to a commonly used password": "Toto heslo se podobá často používanému heslu",
    "A word by itself is easy to guess": "Slovo samo o sobě je velmi lehké na uhádnutí",
    "Names and surnames by themselves are easy to guess": "Jména a příjmení jsou lehká na uhádnutí",
    "Common names and surnames by themselves are easy to guess": "Obvyklá jména a příjmení jsou lehká na uhádnutí",
    "Capitalization doesn't help very much": "Velká písmena příliš nepomohou",
    "All-uppercase is almost as easy to guess as all-lowercase": "Použítí velkých písmen nezlepší bezpečnost hesla",
    "Reversed words aren't much harder to guess": "Slova pozpátku je lehké uhádnout",
    "Predictable substitutions like '@' instead of 'a' don't help very much": "Běžné substituce jako '@' místo 'a' příliš nezlepší hesla"
}

