{
    "Use a few words, avoid common phrases": "Použite niekoľko slov, vyhnite sa bežným frázam",
    "No need for symbols, digits, or uppercase letters": "Nie sú potrebné symboly, číslice alebo veľké písmená",
    "Add another word or two. Uncommon words are better.": "Pridajte jedno alebo dve ďalšie slová. Čím menej obvyklé, tým lepšie.",
    "Straight rows of keys are easy to guess": "Kombinácie susedných znakov sú ľahké na uhádnutie",
    "Short keyboard patterns are easy to guess": "Krátke kombinácie znakov z klávesnice sú ľahké na uhádnutie",
    "Use a longer keyboard pattern with more turns": "Použite dlhší kombinácii znakov",
    "Repeats like 'aaa' are easy to guess": "Opakovanie typu 'aaa' sú ľahké na uhádnutie",
    "Repeats like 'abcabcabc' are only slightly harder to guess than 'abc'": "Opakovanie typu 'abcabcabc' sú len o málo ťažšie na uhádnutie než 'abc'",
    "Avoid repeated words and characters": "Vyhnite sa opakovanie slov a znakov",
    "Sequences like abc or 6543 are easy to guess": "Postupnosti typu 'abc' alebo '6543' sú ľahké na uhádnutie",
    "Avoid sequences": "Vyhnite sa postupnostam",
    "Recent years are easy to guess": "Nedávne roky sú ľahké na uhádnutie",
    "Avoid recent years": "Vyhnite sa použitie nedávnych rokov",
    "Avoid years that are associated with you": "Vyhnite sa použitie rokov, ktoré s Vami majú súvislosť",
    "Dates are often easy to guess": "Dátumy sú ľahké na uhádnutie",
    "Avoid dates and years that are associated with you": "Vyhnite sa použitia dát alebo rokov, ktoré s Vami majú súvislosť",
    "This is a top-10 common password": "Toto je jedno z 10 najpoužívanejších hesiel",
    "This is a top-100 common password": "Toto je jedno z 100 najpoužívanejších hesiel",
    "This is a very common password": "Toto je jedno z najpoužívanejších hesiel",
    "This is similar to a commonly used password": "Toto heslo je veľmi podobné najpoužívanejším heslám",
    "A word by itself is easy to guess": "Slovo samo o sebe je veľmi ľahké na uhádnutie",
    "Names and surnames by themselves are easy to guess": "Mená a priezviská sú ľahké na uhádnutie",
    "Common names and surnames by themselves are easy to guess": "Zvyčajná mená a priezviská sú ľahké na uhádnutie",
    "Capitalization doesn't help very much": "Veľká písmena príliš nepomôžu",
    "All-uppercase is almost as easy to guess as all-lowercase": "Heslá písané len veľkými písmenami sú rovnako ťažká na uhádnutie ako heslá písané len malými písmenami",
    "Reversed words aren't much harder to guess": "Slová pospiatky nie sú moc ťažké na uhádnutie",
    "Predictable substitutions like '@' instead of 'a' don't help very much": "Bežné substitúcie ako '@' miesto 'a' moc nepomáhajú"
}

